```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # cloudflare_record.bluesky-verification will be updated in-place
  ~ resource "cloudflare_record" "bluesky-verification" {
      ~ content         = "\"did=did:plc:yfywvq4oa4bx5gtd2fk3uenw\"" -> "did=did:plc:yfywvq4oa4bx5gtd2fk3uenw"
        id              = "bc737399d98a4dc92cc776bd395399e5"
        name            = "_atproto.thetillhoff.de"
        tags            = []
        # (11 unchanged attributes hidden)
    }

  # cloudflare_record.google-site-verification will be updated in-place
  ~ resource "cloudflare_record" "google-site-verification" {
      + allow_overwrite = false
      ~ content         = "\"google-site-verification=2HI_U5cyyFCcB2OlrH1Ir1BahesDBofU35pVikOQQvg\"" -> "google-site-verification=2HI_U5cyyFCcB2OlrH1Ir1BahesDBofU35pVikOQQvg"
        id              = "81c85bcd96fbceb2046ba072ebbceee9"
        name            = "thetillhoff.de"
        tags            = []
        # (11 unchanged attributes hidden)
    }

  # cloudflare_record.spf will be updated in-place
  ~ resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      ~ content         = "\"v=spf1 include:spf.protection.outlook.com -all\"" -> "v=spf1 include:spf.protection.outlook.com -all"
        id              = "d2249153382fcce1f83414979a162412"
        name            = "thetillhoff.de"
        tags            = []
        # (11 unchanged attributes hidden)
    }

  # module.kubenodes.data.talos_machine_configuration.controlplane will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "controlplane" {
      + cluster_endpoint      = "https://hydra.k8s.thetillhoff.de:6443"
      + cluster_name          = "hydra"
      + config_patches        = [
          + <<-EOT
                machine:
                    network:
                        kubespan:
                            enabled: true
                    kubelet:
                        extraArgs:
                            rotate-server-certificates: true
                    # nodeTaints:
                    #     - cilium-agent-not-ready: node.cilium.io/agent-not-ready
                    # systemDiskEncryption:
                    #     ephemeral:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                    #     state:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                cluster:
                    network:
                        cni:
                            name: none # Disable default CNI
                    proxy:
                        disabled: true # Disable default proxy, as cilium brings its own
                    allowSchedulingOnControlPlanes: true
                    # externalCloudProvider:
                    #     enabled: true # TODO: disable at first?
                    discovery:
                        enabled: true
            EOT,
        ]
      + docs                  = false
      + examples              = false
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
    }

  # module.kubenodes.cloudflare_record.k8s-hydra["0"] will be created
  + resource "cloudflare_record" "k8s-hydra" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hydra.k8s.thetillhoff.de"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "94d9f474ce48a61513a68744b663f5e5"
    }

  # module.kubenodes.cloudflare_record.k8s-hydra["1"] will be created
  + resource "cloudflare_record" "k8s-hydra" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hydra.k8s.thetillhoff.de"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "94d9f474ce48a61513a68744b663f5e5"
    }

  # module.kubenodes.cloudflare_record.k8s-hydra["2"] will be created
  + resource "cloudflare_record" "k8s-hydra" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hydra.k8s.thetillhoff.de"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "94d9f474ce48a61513a68744b663f5e5"
    }

  # module.kubenodes.flux_bootstrap_git.hydra will be created
  + resource "flux_bootstrap_git" "hydra" {
      + cluster_domain       = "cluster.local"
      + components           = [
          + "helm-controller",
          + "kustomize-controller",
          + "notification-controller",
          + "source-controller",
        ]
      + components_extra     = [
          + "image-automation-controller",
          + "image-reflector-controller",
        ]
      + delete_git_manifests = false
      + embedded_manifests   = false
      + id                   = (known after apply)
      + interval             = "1m0s"
      + keep_namespace       = false
      + log_level            = "info"
      + namespace            = "flux-system"
      + network_policy       = true
      + path                 = "kubernetes/clusters/hydra"
      + registry             = "ghcr.io/fluxcd"
      + repository_files     = (known after apply)
      + secret_name          = "flux-system"
      + timeouts             = {
          + create = "10m"
        }
      + version              = "v2.5.1"
      + watch_all_namespaces = true
    }

  # module.kubenodes.hcloud_server.kubenodes["0"] will be created
  + resource "hcloud_server" "kubenodes" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "206520018"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "kubenode-0"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)
      + user_data                  = (sensitive value)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kubenodes.hcloud_server.kubenodes["1"] will be created
  + resource "hcloud_server" "kubenodes" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "206520018"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "kubenode-1"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)
      + user_data                  = (sensitive value)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kubenodes.hcloud_server.kubenodes["2"] will be created
  + resource "hcloud_server" "kubenodes" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "206520018"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "kubenode-2"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)
      + user_data                  = (sensitive value)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kubenodes.helm_release.cilium will be created
  + resource "helm_release" "cilium" {
      + atomic                     = false
      + chart                      = "cilium"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cilium"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.cilium.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ipam:
                    mode: kubernetes
                kubeProxyReplacement: true
                gatewayAPI:
                  enabled: true
                securityContext:
                    capabilities:
                        ciliumAgent:
                            - CHOWN
                            - KILL
                            - NET_ADMIN
                            - NET_RAW
                            - IPC_LOCK
                            # - SYS_MODULE # "As Talos does not allow loading Kernel modules by Kubernetes workloads, SYS_MODULE needs to be dropped from the Cilium default capability list."
                            - SYS_ADMIN
                            - SYS_RESOURCE
                            - DAC_OVERRIDE
                            - FOWNER
                            - SETGID
                            - SETUID
                        cleanCiliumState:
                            - NET_ADMIN
                            - SYS_ADMIN
                            - SYS_RESOURCE
                cgroup:
                    autoMount:
                        enabled: false
                    hostRoot: /sys/fs/cgroup
                k8sServiceHost: localhost
                k8sServicePort: 7445
            EOT,
        ]
      + verify                     = false
      + version                    = "1.17.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubenodes.kubernetes_secret.flux_system will be created
  + resource "kubernetes_secret" "flux_system" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "sops-age"
          + namespace        = "flux-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubenodes.local_sensitive_file.kubeconfig[0] will be created
  + resource "local_sensitive_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "kubenodes/kubeconfig"
      + id                   = (known after apply)
    }

  # module.kubenodes.talos_cluster_kubeconfig.kubeconfig will be created
  + resource "talos_cluster_kubeconfig" "kubeconfig" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = (known after apply)
      + endpoint                        = (known after apply)
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = (known after apply)
    }

  # module.kubenodes.talos_machine_bootstrap.main will be created
  + resource "talos_machine_bootstrap" "main" {
      + client_configuration = (known after apply)
      + endpoint             = (known after apply)
      + id                   = (known after apply)
      + node                 = (known after apply)
    }

  # module.kubenodes.talos_machine_configuration_apply.main[0] will be created
  + resource "talos_machine_configuration_apply" "main" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + config_patches              = [
          + <<-EOT
                machine:
                    network:
                        kubespan:
                            enabled: true
                    kubelet:
                        extraArgs:
                            rotate-server-certificates: true
                    # nodeTaints:
                    #     - cilium-agent-not-ready: node.cilium.io/agent-not-ready
                    # systemDiskEncryption:
                    #     ephemeral:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                    #     state:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                cluster:
                    network:
                        cni:
                            name: none # Disable default CNI
                    proxy:
                        disabled: true # Disable default proxy, as cilium brings its own
                    allowSchedulingOnControlPlanes: true
                    # externalCloudProvider:
                    #     enabled: true # TODO: disable at first?
                    discovery:
                        enabled: true
            EOT,
        ]
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = (known after apply)
      + timeouts                    = {
          + create = "1m"
        }
    }

  # module.kubenodes.talos_machine_configuration_apply.main[1] will be created
  + resource "talos_machine_configuration_apply" "main" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + config_patches              = [
          + <<-EOT
                machine:
                    network:
                        kubespan:
                            enabled: true
                    kubelet:
                        extraArgs:
                            rotate-server-certificates: true
                    # nodeTaints:
                    #     - cilium-agent-not-ready: node.cilium.io/agent-not-ready
                    # systemDiskEncryption:
                    #     ephemeral:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                    #     state:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                cluster:
                    network:
                        cni:
                            name: none # Disable default CNI
                    proxy:
                        disabled: true # Disable default proxy, as cilium brings its own
                    allowSchedulingOnControlPlanes: true
                    # externalCloudProvider:
                    #     enabled: true # TODO: disable at first?
                    discovery:
                        enabled: true
            EOT,
        ]
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = (known after apply)
      + timeouts                    = {
          + create = "1m"
        }
    }

  # module.kubenodes.talos_machine_configuration_apply.main[2] will be created
  + resource "talos_machine_configuration_apply" "main" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + config_patches              = [
          + <<-EOT
                machine:
                    network:
                        kubespan:
                            enabled: true
                    kubelet:
                        extraArgs:
                            rotate-server-certificates: true
                    # nodeTaints:
                    #     - cilium-agent-not-ready: node.cilium.io/agent-not-ready
                    # systemDiskEncryption:
                    #     ephemeral:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                    #     state:
                    #         provider: luks2
                    #         keys:
                    #             - nodeID: {}
                    #               slot: 0
                cluster:
                    network:
                        cni:
                            name: none # Disable default CNI
                    proxy:
                        disabled: true # Disable default proxy, as cilium brings its own
                    allowSchedulingOnControlPlanes: true
                    # externalCloudProvider:
                    #     enabled: true # TODO: disable at first?
                    discovery:
                        enabled: true
            EOT,
        ]
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = (known after apply)
      + timeouts                    = {
          + create = "1m"
        }
    }

  # module.kubenodes.talos_machine_secrets.main will be created
  + resource "talos_machine_secrets" "main" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.9"
    }

  # module.kubenodes.time_sleep.wait_for_dns will be created
  + resource "time_sleep" "wait_for_dns" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.kubenodes.time_sleep.wait_for_talos_bootstrap will be created
  + resource "time_sleep" "wait_for_talos_bootstrap" {
      + create_duration = "5s"
      + id              = (known after apply)
    }

  # module.kubenodes.time_sleep.wait_for_talos_config_apply will be created
  + resource "time_sleep" "wait_for_talos_config_apply" {
      + create_duration = "5s"
      + id              = (known after apply)
    }

  # module.kubenodes.time_sleep.wait_for_vm_creation will be created
  + resource "time_sleep" "wait_for_vm_creation" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

Plan: 20 to add, 3 to change, 0 to destroy.
```
